# Computando estadística agregada/sumativa

Es posible realizar en Pandas diferentes cálculos tipicos sumativos básicos de la estadística:

In [3]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]

GradeList = zip(names,grades)

df = pd.DataFrame(data=GradeList, columns=['Names','Grades'])

df

     Names  Grades
0      Bob      76
1  Jessica      95
2     Mary      77
3     John      78
4      Mel      99

In [4]:
df['Grades'].count() # number of values

5

In [5]:
df['Grades'].mean() # arithmetic average

85.0

In [6]:
df['Grades'].std() # standard deviation

11.067971810589327

In [7]:
df['Grades'].min() # minimum

76

In [8]:
df['Grades'].max() # maximum

99

In [9]:
df['Grades'].quantile(.25) # first quartile

77.0

In [10]:
df['Grades'].quantile(.5) # second quartile

78.0

In [11]:
df['Grades'].quantile(.75) # third quartile

95.0

Varias medidas de tendencia central:

In [12]:
# mean = dividing the sum by the number of values
df['Grades'].mean()

85.0

In [13]:
# median = the middle value if they are sorted in order
df['Grades'].median()

78.0

In [14]:
# mode = the most common single value
df['Grades'].mode()

0    76
1    77
2    78
3    95
4    99
Name: Grades, dtype: int64

Calculando la varianza:

In [15]:
# computes the variance of the values in a column
df['Grades'].var()

122.5

In [16]:
# Calculando la varianza a partir de la desviación estandar:

df['Grades'].std() ** 2

122.49999999999999

Es posible calcular la varianza sobre todas las columnas numéricas:

In [17]:
df.var()

/tmp/ipykernel_1364/1568254755.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.var()

Grades    122.5
dtype: float64

## Ej-1 Estadística sumativa 

Para el siguiente Dataframe calcula la estadística sumativa para los siguientes datos. Crea el dataset correspondiente:

In [18]:
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

# Estadística sumativa sobre filtros de renglones

In [19]:
import pandas as pd

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bs = [1,1,0,0,1]
ms = [2,1,0,0,0]
phd = [0,1,0,0,0]
GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Name','Grade','BS','MS','PhD'])

df

      Name  Grade  BS  MS  PhD
0      Bob     76   1   2    0
1  Jessica     95   1   1    1
2     Mary     77   0   0    0
3     John     78   0   0    0
4      Mel     99   1   0    0

Contando el número de personas que no tienen doctorado:

In [20]:
df.loc[df['PhD']==0]['PhD'].count()

4

Calculando la calificación promedio de los que no tienen doctorado:

In [21]:
df.loc[df['PhD']==0]['Grade'].mean()

82.5

# Ej-2 Calculando promedios con dataframes con filtros

Para el siguiente dataframe calcula el promedio de los estudiantes que tienen grado de maestría:

In [22]:
import pandas as pd

names = ['Bob','Jessica','Mary','John', 'Mel','Sam','Cathy','Henry','Lloyd']
grades = [76,95,77,78,99,84,79,100,73]
bs = [1,1,0,0,1,1,1,0,1]
ms = [2,1,0,0,0,1,1,0,0]
phd = [0,1,0,0,0,2,1,0,0]

GradeList = zip(names,grades,bs,ms,phd)

df = pd.DataFrame(data=GradeList, columns=['Names','Grades','BS','MS','PhD'])

df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0
5      Sam      84   1   1    2
6    Cathy      79   1   1    1
7    Henry     100   0   0    0
8    Lloyd      73   1   0    0

# Ordenando los datos

Es posible ordenar los datos de forma ascendente o descendente. Muy útil para muchos cálculos en Dataframes.

In [23]:
import pandas as pd

Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [24]:
df = df.sort_values(by='age', ascending=0)
df

,fname,lname,gender,age,exercise,hours,grade,address
1000,Hanna,Mooney,female,19,2,10,88.8,"8293 SW. Cedar Swamp Lane, Union, NJ 07083"
902,Steven,Graham,male,19,4,17,95.1,"90 Grove St., Camas, WA 98607"
818,Colette,Rojas,female,19,4,6,73.3,"17 Pin Oak Street, Villa Park, IL 60181"
822,Rinah,Jacobson,female,19,1,7,80.8,"737 Amherst Court, Amsterdam, NY 12010"
826,Hayes,Wilkinson,male,19,5,3,76.0,"350 Temple Court, Mason City, IA 50401"
...,...,...,...,...,...,...,...,...
85,Porter,Ware,male,14,1,16,90.4,"52 Shirley Drive, Merrick, NY 11566"
587,Kiona,Collier,female,14,4,11,84.0,"827 Rockledge Rd., New Port Richey, FL 34653"
588,Jocelyn,Ashley,female,14,3,9,73.4,"830 Amerige Drive, Davenport, IA 52804"
89,Lucius,Herrera,male,14,2,19,88.0,"67 Old Clinton Dr., Lynn, MA 01902"
294,Illiana,Branch,female,14,5,4,69.8,"9730 Van Dyke Court, Port Orange, FL 32127"

In [25]:
df = df.sort_values(by=['grade', 'age'], ascending=[True, True])

df.tail()

,fname,lname,gender,age,exercise,hours,grade,address
1844,Yael,Hatfield,female,19,2,18,100.0,"9612 Sherman Avenue, Elk River, MN 55330"
101,Sage,Cleveland,female,19,2,20,100.0,"9721B Green Dr., Fairhope, AL 36532"
17,Libby,Guzman,female,19,1,19,100.0,"666 S. Pennington Rd., Dover, NH 03820"
36,Ivor,Arnold,male,19,4,20,100.0,"7027 Magnolia Dr., Catonsville, MD 21228"
109,Sophia,Gordon,female,19,4,17,100.0,"7672 Smoky Hollow Street, Hillsboro, OR 97124"

## Ej-3 Ordenamiento

¿Podrías ordenar el dataframe por nombre, edad y grado?

In [26]:
#Ej-3 ....

## Correlación entre los datos

Permite encontrar la correlación entre parejas de datos.

In [27]:
import pandas as pd

Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [28]:
df.corr()

               age  exercise     hours     grade
age       1.000000 -0.003643 -0.017467 -0.007580
exercise -0.003643  1.000000  0.021105  0.161286
hours    -0.017467  0.021105  1.000000  0.801955
grade    -0.007580  0.161286  0.801955  1.000000

# Ej-4 Correlaciones

Encuentra todas las correlaciones entre los campos de datasets/tamiami.csv

In [29]:
# Ej-4

import pandas as pd

Location = "datasets/tamiami.csv"

## Regresion

En modelado estadístico, el análisis de regresión es un proceso estadístico para estimar la relación entre variables. Buscamos crear una ecuación que explique el valor de una variable dependiente basado en otras variables independientes.

In [30]:
import pandas as pd
Location = "datasets/gradedata.csv"

df = pd.read_csv(Location)
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [31]:
import statsmodels.formula.api as sm
result = sm.ols(formula='grade ~ age + exercise + hours', data=df).fit()

result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  grade   R-squared:                       0.664
Model:                            OLS   Adj. R-squared:                  0.664
Method:                 Least Squares   F-statistic:                     1315.
Date:                Tue, 05 Apr 2022   Prob (F-statistic):               0.00
Time:                        16:11:42   Log-Likelihood:                -6300.7
No. Observations:                2000   AIC:                         1.261e+04
Df Residuals:                    1996   BIC:                         1.263e+04
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept     57.8704      1.321     43.804      0.000      55.279      60.461
age            0.0397      0.075      0.532      0.595      -0.107       0.186
exercise       0.9893      0.089     11.131      0.000       0.815       1.164
hours          1.9165      0.031     61.564      0.000       1.855       1.978
==============================================================================
Omnibus:                      321.187   Durbin-Watson:                   2.047
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             2196.187
Skew:                          -0.567   Prob(JB):                         0.00
Kurtosis:                       8.007   Cond. No.                         213.
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

In [32]:
import statsmodels.formula.api as sm
result = sm.ols(formula='grade ~  exercise + hours', data=df).fit()

result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                            OLS Regression Results
==============================================================================
Dep. Variable:                  grade   R-squared:                       0.664
Model:                            OLS   Adj. R-squared:                  0.664
Method:                 Least Squares   F-statistic:                     1973.
Date:                Tue, 05 Apr 2022   Prob (F-statistic):               0.00
Time:                        16:11:43   Log-Likelihood:                -6300.8
No. Observations:                2000   AIC:                         1.261e+04
Df Residuals:                    1997   BIC:                         1.262e+04
Df Model:                           2
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
Intercept     58.5316      0.447    130.828      0.000      57.654      59.409
exercise       0.9892      0.089     11.131      0.000       0.815       1.163
hours          1.9162      0.031     61.575      0.000       1.855       1.977
==============================================================================
Omnibus:                      318.721   Durbin-Watson:                   2.048
Prob(Omnibus):                  0.000   Jarque-Bera (JB):             2158.000
Skew:                          -0.564   Prob(JB):                         0.00
Kurtosis:                       7.962   Cond. No.                         43.2
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

## Ej-5 Regresión

Convierte el género (Femenino/Masculino) a un valor numérico (1/0) para construir un nuevo modelo de regresión donde se incluya al género. ¿Mejora esto el coeficiente de determinación R-squared?

In [33]:
#Ej-5 ...

# Modelo de regresión lineal sin Intercepto

Eliminando el intercepto con el eje de las Y, en ocasiones permite encontrar un Modelo de Regresión mejorado en lo que se refiere al Coeficiente de determinación (R-Squared).

In [34]:
import pandas as pd
Location = "datasets/gradedata.csv"
df = pd.read_csv(Location)
df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [35]:
result = sm.ols(formula='grade ~ age + exercise + hours - 1', data=df).fit()
result.summary()

<class 'statsmodels.iolib.summary.Summary'>
"""
                                 OLS Regression Results
=======================================================================================
Dep. Variable:                  grade   R-squared (uncentered):                   0.991
Model:                            OLS   Adj. R-squared (uncentered):              0.991
Method:                 Least Squares   F-statistic:                          7.284e+04
Date:                Tue, 05 Apr 2022   Prob (F-statistic):                        0.00
Time:                        16:11:44   Log-Likelihood:                         -6974.3
No. Observations:                2000   AIC:                                  1.395e+04
Df Residuals:                    1997   BIC:                                  1.397e+04
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
age            3.1129      0.035     88.030      0.000       3.044       3.182
exercise       1.7659      0.122     14.482      0.000       1.527       2.005
hours          2.2860      0.042     54.486      0.000       2.204       2.368
==============================================================================
Omnibus:                      131.221   Durbin-Watson:                   2.006
Prob(Omnibus):                  0.000   Jarque-Bera (JB):              403.367
Skew:                          -0.301   Prob(JB):                     2.57e-88
Kurtosis:                       5.116   Cond. No.                         14.2
==============================================================================

Notes:
[1] R² is computed without centering (uncentered) since the model does not contain a constant.
[2] Standard Errors assume that the covariance matrix of the errors is correctly specified.
"""

## Ej-6 Comparando Modelos de regresión.

Construye Modelos de Regresión para: (1) Grade & Age (2) Grade & Excercise (3) Grade & Study. Si tuvieras que seleccionar uno, ¿Cuál seleccionarías? ¿Porqué?

In [36]:
# Ej-6

# Modelo seleccionado:

Modelo X

# ¿Porqué?

Por ...

## Pivot Table (Tablas Dinámicas)

Es posible crear Tablas Dinámicas como en Excel con Pandas. Las Tablas Dinámicas permite encontrar relaciones de agregación/suma entre columnas en formato tabular:

In [37]:
import pandas as pd

Location = "datasets/gradedata.csv"

df = pd.read_csv(Location)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.2,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.4,"8304 Charles Rd., Lewis Center, OH 43035"

In [38]:
pd.pivot_table(df, index=['gender'])

           age  exercise    grade   hours
gender
female  16.568     3.047  82.7173  10.932
male    16.589     2.954  82.3948  11.045

Promedio de calificaciones por género:

In [39]:
pd.pivot_table(df, values=['grade'], index=['gender'])

          grade
gender
female  82.7173
male    82.3948

In [40]:
pd.pivot_table(df, values=['grade'], index=['gender'], aggfunc='min')

        grade
gender
female   32.0
male     43.0

In [41]:
pd.pivot_table(df, index=['gender','age'], aggfunc='max', values=['hours'])

            hours
gender age
female 14      20
       15      20
       16      19
       17      20
       18      20
       19      20
male   14      19
       15      20
       16      20
       17      20
       18      20
       19      20

In [42]:
pd.pivot_table(df, index=['gender'], aggfunc='mean', values=['grade','hours'])

          grade   hours
gender
female  82.7173  10.932
male    82.3948  11.045

Este es un ejemplo de Tabla Dinámica sobre un subconjunto del Dataframe:

In [43]:
df2 = df.loc[df['age'] == 17]
pd.pivot_table(df2,index=['gender'], aggfunc='mean', values=['grade','hours'])

            grade      hours
gender
female  83.599435  10.943503
male    82.949721  11.268156

Simplificando la construcción de la Tabla Dinámica:

In [44]:
df2 = df[df['age'] == 17]
pd.pivot_table(df2,index=['gender'], values=['grade','hours'])

            grade      hours
gender
female  83.599435  10.943503
male    82.949721  11.268156

Promedios de Calificaciones y Horas por Género, incluyendo totales:

In [46]:
df2 = df[df['age'] == 17]
pd.pivot_table(df2,index=['gender'], values=['grade','hours'], margins='True', margins_name="Prom/Prom")

               grade      hours
gender
female     83.599435  10.943503
male       82.949721  11.268156
Prom/Prom  83.272753  11.106742

# Ej-7 Tablas Dinámicas

¿Podrías crear una Tabla Dinámica mostrando la calificación promedio por género de las personas que tuvieron más de 2 horas de ejercicio?

In [ ]:
#Ej-7 ....